backend/load-test/socket-load-test.yml
config:
  target: "http://localhost:5000"
  engines:
    socketio-v3:
     transports: ["websocket"]
     query:
       x-demo-role:"learner"
       x-demo-user-id:"load-test-{{ $randomNumber(1,100000) }}"
  phases:
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: "Warm up"
    - duration: 90
      arrivalRate: 40
      name: "Sustained 200+ concurrent"

scenarios:
  - engine: socketio-v3
    socketio:
    flow:
      - emit:
          channel: "room:join"
          data: "load-test-room"
      - think: 5
      - emit:
          channel: "room:leave"
          data: "load-test-room"
      - think: 1